In [1]:
import pandas as pd
import numpy as np
import plotly as plotly
import numpy as np
from pydataset import data

In [2]:
# Pandas
# Creating series by passing a list of values, letting pandas create a default int index.


series = pd.Series([1, 3, 5, np.nan, 6, 8], index=["a", "b", "c", "d", "e", "f"])
print(series)
print(series["c"])
print(series.index)

a    1.0
b    3.0
c    5.0
d    NaN
e    6.0
f    8.0
dtype: float64
5.0
Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [ ]:

# Data frames

dates = pd.date_range("20230101", periods = 6)
dates

# Creating a data frame with 6 rows and 4 columns
# columns accepts lists only
df = pd.DataFrame(np.random.randn(6, 4), index = dates, columns = ["Column1", "Column2", "Column3", "Column4"])
df

In [ ]:
# Creating a data frame by passing a dictionary of objects that can be converted into a series-like structure:
df2 = pd.DataFrame(
    {
        "Column1": 2.5,
        "Column2": pd.Timestamp("20210406"),
        "Column3": pd.Series(1, index = list(range(4)), dtype = "float32"),
        "column4": np.array([5] * 4, dtype = "int32"),
        "column5": pd.Categorical(["yes", "no", "no", "yes"]),
        "column5": "I am a string!"
    }
)
df2
#print(df2.dtypes)

In [99]:
# Importing .zip files
import_zip = pd.read_csv("college_scorecard_2017-18.zip", dtype = {"OPEID":str})
import_zip.head()
import_zip.info()
collegeScore = import_zip
display(collegeScore)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7058 entries, 0 to 7057
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   OPEID     7058 non-null   object
 1   INSTNM    7058 non-null   object
 2   CITY      7058 non-null   object
 3   STABBR    7058 non-null   object
 4   ZIP       7058 non-null   object
 5   INSTURL   7039 non-null   object
 6   REGION    7058 non-null   int64
 7   LOCALE    6614 non-null   float64
 8   ADM_RATE  2019 non-null   float64
 9   COSTT4_A  3572 non-null   float64
dtypes: float64(3), int64(1), object(6)
memory usage: 551.5+ KB

,OPEID,INSTNM,CITY,STABBR,ZIP,INSTURL,REGION,LOCALE,ADM_RATE,COSTT4_A
0,00100200,Alabama A & M University,Normal,AL,35762,www.aamu.edu/,5,12.0,0.9027,22886.0
1,00105200,University of Alabama at Birmingham,Birmingham,AL,35294-0110,www.uab.edu,5,12.0,0.9181,24129.0
2,02503400,Amridge University,Montgomery,AL,36117-3553,www.amridgeuniversity.edu,5,12.0,NaN,15080.0
3,00105500,University of Alabama in Huntsville,Huntsville,AL,35899,www.uah.edu,5,12.0,0.8123,22108.0
4,00100500,Alabama State University,Montgomery,AL,36104-0271,www.alasu.edu,5,12.0,0.9787,19413.0
...,...,...,...,...,...,...,...,...,...,...
7053,00108163,Arizona State University at Yuma,Yuma,AZ,853656900,www.asu.edu/,6,NaN,NaN,NaN
7054,04223701,Bay Area Medical Academy - San Jose Satellite Location,San Jose,CA,95113,www.bamasf.com/,8,NaN,NaN,NaN
7055,04228101,High Desert Medical College,Lancaster,CA,935340000,www.hdmc.edu,8,NaN,NaN,NaN
7056,04221501,BCI - Malden,Malden,MA,21480000,bostoncareer.org,1,NaN,NaN,NaN
7057,04182601,Health Career Institute- Lauderdale Lakes,Lauderdale Lakes,FL,333137268,www.hci.edu/,5,NaN,NaN,NaN

In [ ]:
# Replacing values in the data frame
df2_replace = df2.replace(2.5, 9.9)
df2_replace

In [10]:
# adding new column to existing data frame
column6 = ["address1", "address2", "address3", "address4"]

# using column6 as the column name
df2["column6"] = column6
print(df2)

   Column1    Column2  Column3  column4         column5   column6
0      2.5 2021-04-06      1.0        5  I am a string!  address1
1      2.5 2021-04-06      1.0        5  I am a string!  address2
2      2.5 2021-04-06      1.0        5  I am a string!  address3
3      2.5 2021-04-06      1.0        5  I am a string!  address4

In [3]:
import plotly as plotly
import numpy as np
from pydataset import data
df_list = data()
print((type(data())))

<class 'pandas.core.frame.DataFrame'>

In [24]:
df_list.to_csv("df_list.csv")

In [29]:
dataset = data("USPersonalExpenditure")
dataset.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Food and Tobacco to Private Education
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   1940    5 non-null      float64
 1   1945    5 non-null      float64
 2   1950    5 non-null      float64
 3   1955    5 non-null      float64
 4   1960    5 non-null      float64
dtypes: float64(5)
memory usage: 240.0+ bytes

In [16]:
# Web scraping 
# Read html tables
url = "https://en.wikipedia.org/w/index.php?title=World_population&oldid=948301297"
dfread = pd.read_html(url)
dfread = dfread[12]
#dfread[12].head()

In [62]:
url2 = "https://en.wikipedia.org/wiki/List_of_European_regions_by_unemployment_rate"
dfread2 = pd.read_html(url2)
print(dfread2)
dfread2.head()

[                          Region (NUTS2)  Country  2006  2007  2008  2009  \
0                               Brussels  Belgium  17.6  17.1  15.9  15.7
1                                Antwerp  Belgium   5.7   5.0   4.6   5.7
2                                Limburg  Belgium   6.2   5.3   4.4   5.4
3                          East Flanders  Belgium   4.5   4.8   3.6   4.2
4                        Flemish Brabant  Belgium   4.2   3.4   4.9   4.9
..                                   ...      ...   ...   ...   ...   ...
321  Malatya, ElazÄ±ÄŸ, BingÃ¶l and Tunceli   Turkey  10.5  10.6  12.3  14.8
322         Van, MuÅŸ, Bitlis and HakkÃ¢ri   Turkey   6.9  11.4  12.6  14.6
323        Gaziantep, AdÄ±yaman and Kilis   Turkey  12.6  16.9  15.0  14.3
324             ÅžanlÄ±urfa and DiyarbakÄ±r   Turkey  10.8  12.9  12.8  16.7
325     Mardin, Batman, ÅžÄ±rnak and Siirt   Turkey  13.5  18.0  15.8  13.8

     2010  2011  2012  2013  2014  2015  2016  2017  2018
0    17.3  16.9  17.4  19.3  18.3  17.3  16.7  14.8  13.2
1     6.0   5.7   5.3   6.2   6.1   6.1   6.1   5.9   4.3
2     5.3   4.6   4.7   5.5   5.6   6.0   4.8   4.1   3.8
3     5.2   3.8   4.1   4.0   4.3   4.4   4.2   3.4   2.7
4     4.8   3.5   4.4   5.5   5.0   5.1   4.8   4.7   3.6
..    ...   ...   ...   ...   ...   ...   ...   ...   ...
321  10.6   7.8   5.8   5.7   7.9   7.9   8.8   6.8   8.0
322  15.5  11.0   7.5   9.2  13.4   9.7   9.1  12.6  21.6
323  11.4  13.2  10.6   6.2   8.1   9.7  13.9  14.3  12.3
324  11.1   6.8   6.0  16.0  17.5  17.4  17.2  13.8  18.6
325  10.4  10.3  18.8  19.4  24.0  24.4  28.1  26.9  24.8

[326 rows x 15 columns]]

AttributeError: 'list' object has no attribute 'head'

In [87]:
url3 = "https://en.wikipedia.org/wiki/Economy_of_the_European_Union"
dfread3 = pd.read_html(url3)
print(f'Total tables: {len(dfread3)}') # -> 37 tables

# To make table selection easier, use 'match' parameter
dfread3_match= pd.read_html(url3, match = "Main trading partners 2008â€“2011")
print(f"Total tables when 'match' argument used: {len(dfread3_match)}") # 1 table

tradingPartners = dfread3_match[0]
print(type(tradingPartners)) # tradingPartners is a data frame

tradingPartners.info() # getting info on tradingPartners data frame
#df = mainTradingPartner[0]
#df.head()
#df.info()

Total tables: 37
Total tables when 'match' argument used: 1
<class 'pandas.core.frame.DataFrame'>

In [31]:
# Anonymous functions
a = 5
b = lambda x:a+1 # b is a lambda function
result = b(5)
print(result)

6

In [32]:
product = lambda x, y: x*y
result = product(5,2)
print(result)

10

In [33]:
addition = lambda x, y: x+y
result = addition(2,3)
print(result)

5

In [36]:
a = list(range(10))
b = []
for element in a:
    b.append((lambda element: element*element)(element))

print(a)
print(b)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
[0, 1, 4, 9, 16, 25, 36, 49, 64, 81]

In [50]:
#filter by numbers divisible by 3
print(list(filter(lambda x:x%3==0, a)))

list(map(lambda x: {x: 'a'} if(x%2 ==0) else x, a))

[0, 3, 6, 9]

[{0: 'a'}, 1, {2: 'a'}, 3, {4: 'a'}, 5, {6: 'a'}, 7, {8: 'a'}, 9]

In [65]:
list = [1,2,3,4,5]
print(map(lambda x : x*10, list))

<map object at 0x133c04310>

In [66]:
# map function always returns a key value pair.
tpl = tuple(map(lambda x : x*10, list))
tpl

(10, 20, 30, 40, 50)

   col1  col2  col3  col4
0     1     0    10    10
1     2     0    20    20
2     3     0    30    30
3     4     0    40    40
4     5     0    50    50

In [81]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4,5],
                   'col2':[0,0,0,0,0]})
print(df)
df['col3']=df['col1'].map(lambda x :x*10)
display(df)

   col1  col2
0     1     0
1     2     0
2     3     0
3     4     0
4     5     0

   col1  col2  col3
0     1     0    10
1     2     0    20
2     3     0    30
3     4     0    40
4     5     0    50

In [82]:
df['col4'] = df['col1'].apply(lambda x :x*10)
df

   col1  col2  col3  col4
0     1     0    10    10
1     2     0    20    20
2     3     0    30    30
3     4     0    40    40
4     5     0    50    50

In [83]:
# Defining a new column 'col5' using the values from 'col3'. However, values in col5 will be subjected to:
# Replacing values less than 30 in column 4. Those >= 30 will retain their original values
df['col5'] = df['col3'].map(lambda x : 30 if x <30 else x)
df

   col1  col2  col3  col4  col5
0     1     0    10    10    30
1     2     0    20    20    30
2     3     0    30    30    30
3     4     0    40    40    40
4     5     0    50    50    50

In [94]:
from functools import reduce
myList = [2, 4, 6, 8, 10, 12, 14]
b = reduce(lambda x, y: x + y, myList)
result = b
print(result)

c = reduce(lambda x, y: x - y, myList)
result = c
print(result)

create_dict = lambda **kwargs:kwargs
print(create_dict(a=1, b=2, c=3))

56
-52
{'a': 1, 'b': 2, 'c': 3}

In [97]:
multiply = lambda x, *args, **kwargs: x * sum(args) * kwargs['multiplier']
print(multiply(1,2,3, multiplier = 3))

#

15